package com.example.simplefiwiarduino

// Определяем списки и словари команд и определений
val startWords = listOf("робот", "бот", "тетработ", "тэтработ", "эрдвадэдва", "пепелац")    // Список начала команды роботу
val stopWords = listOf("стоп", "стой", "отставить", "прекратить")  // Список стоп слов
val selectDigit = listOf("BB00", "B00B") // Левая и правая граница при выделении цифры

// Словарь команд
val commandMapping = mapOf(
    "робот" to "AAAA",
    "бот" to "AAAA",
    "тетработ" to "AAAA",
    "тэтработ" to "AAAA",
    "эрдвадэдва" to "AAAA",
    "пепелац" to "AAAA",

    "стоп" to "0000",
    "стой" to "0000",
    "отставить" to "0000",
    "прекратить" to "0000",

    "шаг" to "00A0",
    "шага" to "00A0",
    "шагов" to "00A0",
    "метр" to "00B0",
    "метра" to "00B0",
    "метров" to "00B0",
    "градуса" to "00C0",
    "градусов" to "00C0",
    "градус" to "00C0",

    "вперед" to "0001",
    //"прямо" to "0001",
    "вперёд" to "0001",
    "назад" to "0002",
    "влево" to "0003",
    //"левее" to "0003",
    "вправо" to "0004",

    //"манипулятор вверх" to "0005",
    //"манипулятор вниз" to "0006",
    //"сжать клешню" to "0007",
    //"расжать клешню" to "0008",
    //"повернуть клешню по часовой стрелке" to "0009",
    //"повернуть клешню против часовой стрелки" to "000A",

    "повернись" to "000B",
    "повернуть" to "000B",
    "повернуться" to "000B",
    "поворот" to "000B",

    "развернуться" to "000C",

    "вверх" to "0010",
    "поднять" to "0010",
    "вниз" to "0011",
    "опустить" to "0011",
    "сжать" to "0012",
    "зажать" to "0012",
    "расжать" to "0013",
    //"поднять" to "0014",
    //"опустить" to "0015",
    "по" to "0020",
    "против" to "0021",
    "часовой" to "0022",
    "стрелки" to "0023",
    "стрелке" to "0023",
    "манипулятор" to "0030",
    "манипулятора" to "0030",
    "клешню" to "0031",
    // Добавьте другие команды по мере необходимости
    // Можем вводить синонимы команд, если под разными словами подразумеваем одно действие
)